Repository: KDE/kjumpingcube
Catalog: po/*/kjumpingcube.po
Languages: ar, eo

# NAME OF TRANSLATORS
source: Your names
ar: زايد السعيدي
eo: Wolfram Diestel,Oliver Kellogg

# EMAIL OF TRANSLATORS
source: Your emails
ar: zayed.alsaidi@gmail.com
eo: wolfram@steloj.de,okellogg@users.sourceforge.net

source: Sorry, doing a move…
ar: آسف، القيام بخطوة…
eo: Pardonu, farante movon…

source: Game over
ar: انتهت اللعبة
eo: Ludo finiĝis

source: The winner is Player %1!
ar: الفائز هو اللاعب %1!
eo: La gajninto estas Ludanto %1!

source: Winner
ar: الفائز
eo: Gajninto

source: General
ar: عام
eo: Ĝenerala

source: Start game
ar: ابدأ اللعبة
eo: Komenci ludon

source: Continue game
ar: استمر في اللعبة
eo: Daŭrigi ludon

source: Start computer move
ar: بدء تحرك الحاسوب
eo: Komenci komputilan movon

source: Your turn
ar: دورك
eo: Via vico

source: Player %1
ar: اللاعب %1
eo: Ludanto %1

source: Computer player %1 is moving
ar: اللاعب الحاسوبي %1 يتحرك
eo: Komputila ludanto %1 moviĝas

source: The computer could not find a valid move.
ar: تعذر على الحاسوب العثور على حركة صالحة.
eo: La komputilo ne povis trovi validan movon.

source: Show next step
ar: أظهر الخطوة التالية
eo: Montri sekvantan paŝon

source: Finishing move…
ar: الخطوة النهائية…
eo: Finante movon…

source: Interrupt game
ar: مقاطعة اللعبة
eo: Interrompi ludon

source: Stop computing
ar: أوقف الحوسبة
eo: Ĉesigi komputadon

source: Stop showing move
ar: أوقف عن إظهار الحركة
eo: Ĉesigi montri movon

source: Stop animation
ar: أوقف الرسوم المتحركة
eo: Ĉesigi animacion

source: New Game
ar: لعبة جديدة
eo: Nova ludo

source: The file %1 already exists. Do you want to overwrite it?
ar: الملف %1 موجود فعلًا. هل تريد الكتابة فوقه؟
eo: La dosiero %1 jam ekzistas. Ĉu vi volas anstataŭigi ĝin?

source: Game saved as %1
ar: حُفظت اللعبة باسم %1
eo: Ludo sekurigita kiel %1

source: There was an error in saving file %1
ar: حدث خطأ أثناء حفظ الملف %1
eo: Okazis eraro dum sekurigo al la dosiero %1

source: The file %1 does not exist!
ar: الملف %1 غير موجود!
eo: La dosiero %1 ne ekzistas!

source: The file %1 is not a KJumpingCube gamefile!
ar: الملف %1 ليس ملف لعبة المعكب القافز ك!
eo: La dosiero %1 ne estas luddosiero de KJumpingCube!

source: There was an error loading file %1
ar: حدث خطأ أثناء فتح الملف %1
eo: Okazis eraro dum legado de la dosiero %1

source: You have changed the size setting of the game and that requires a new game to start. Do you wish to abandon the current game or continue playing and restore the previous size setting?
ar: غيرت إعداد حجم اللعبة وهذا يتطلب لعبة جديدة للبدء. هل ترغب في التخلي عن اللعبة الحالية أو مواصلة اللعب واستعادة إعداد الحجم السابق؟
eo: Vi ŝanĝis la grandecon de la ludo kaj tio postulas novan ludon por komenci. Ĉu vi volas forlasi la nunan ludon aŭ daŭrigi ludi kaj restarigi la antaŭan grandecon?

source: You have requested a new game, but there is already a game in progress. Do you wish to abandon the current game?
ar: لقد طلبت لعبة جديدة، ولكن هناك فعلًا لعبة قيد التقدم. هل ترغب في التخلي عن اللعبة الحالية؟
eo: Vi petis novan ludon, sed jam estas ludo en progreso. Ĉu vi volas forlasi la nunan ludon?

source: New Game?
ar: لعبة جديدة؟
eo: Ĉu Nova Ludo?

source: Abandon Game
ar: لعبة مهجورة
eo: Forlasi Ludon

source: Continue Game
ar: متابعة اللعبة
eo: Daŭrigi Ludon

source: The file's cube box size is outside the range %1 to %2. It will be set to %1.
ar: حجم الصندوق المكعب للملف خارج النطاق من %1 إلى %2. سيعين إلى %1.
eo: La kubkesta grandeco de la dosiero estas ekster la intervalo %1 ĝis %2. Ĝi estos agordita al %1.

source: Missing input line for cube %1.
ar: خط الإدخال مفقود للمكعب %1.
eo: Mankas eniglinio por kubo %1.

source: Owner of cube %1 is outside the range 0 to 2.
ar: مالك المكعب %1 خارج النطاق من 0 إلى 2.
eo: Posedanto de kubo %1 estas ekster la intervalo 0 ĝis 2.

source: Value of cube %1 is outside the range 1 to %2.
ar: قيمة المكعب %1 خارج النطاق من 1 إلى %2.
eo: Valoro de kubo %1 estas ekster la intervalo 1 ĝis %2.

source: Current player is neither 1 nor 2.
ar: اللاعب الحالي ليس 1 ولا 2.
eo: Nuna ludanto estas nek 1 nek 2.

source: Current player:
ar: اللاعب الحالي:
eo: Nuna ludanto:

source: Settings
ar: إعدادات
eo: Agordoj

source: Animation speed of overflowing dice
ar: سرعة الرسوم المتحركة للنرد الفائض
eo: Animacia rapideco de superfluantaj ĵetkuboj

source: Animation type None (no pauses).
ar: نوع الرسوم المتحركة لا شيء (دون توقف مؤقت).
eo: Animaciotipo Neniu (neniu paŭzoj).

source: Animation type Darken and pause.
ar: نوع الرسوم المتحركة داكن وإيقاف مؤقت.
eo: Animaciotipo Mallumigi kaj paŭzi.

source: Animation type Blink rapidly.
ar: نوع الرسوم المتحركة يومض بسرعة.
eo: Animaciotipo Palpebrumi rapide.

source: Animation type Scatter dots.
ar: نوع الرسوم المتحركة نقاط مبعثرة.
eo: Animaciotipo Disĵetaj punktoj.

source: Color of neutral cubes.
ar: لون المكعبات الطبيعية.
eo: Koloro de neŭtralaj kuboj.

source: Color of player 1.
ar: لون اللاعب1
eo: Koloro de ludanto 1.

source: Color of player 2.
ar: لون اللاعب2
eo: Koloro de ludanto 2.

source: Size of the playing field.
ar: حجم حقل اللعب.
eo: Grandeco de la ludkampo.

source: Whether player 1 is played by the computer.
ar: اذا كان اللاعب1 يلعب بواسطة الجهاز.
eo: Ĉu la ludanto 1 estas ludata fare de la komputilo.

source: Whether computer player 1 uses Kepler AI.
ar: ما إذا كان اللاعب الحاسوبي 1 يستخدم Kepler AI أم لا.
eo: Ĉu komputilludanto 1 uzas Kepler AI.

source: Whether computer player 1 uses Newton AI.
ar: ما إذا كان اللاعب الحاسوبي 1 يستخدم Newton AI.
eo: Ĉu komputilludanto 1 uzas Newton AI.

source: Skill of computer player 1.
ar: مهارة لاعب الحاسوبي 1.
eo: Kapablo de komputilludanto 1.

source: Whether player 2 is played by the computer.
ar: إذا كان اللاعب2 يلعب بواسطة الجهاز.
eo: Ĉu la ludanto 2 estas ludata de la komputilo.

source: Whether computer player 2 uses Kepler AI.
ar: ما إذا كان اللاعب الحاسوبي 2 يستخدم Kepler AI أم لا.
eo: Ĉu komputilludanto 2 uzas Kepler AI.

source: Whether computer player 2 uses Newton AI.
ar: ما إذا كان اللاعب الحاسوبي 2 يستخدم Newton AI.
eo: Ĉu komputilludanto 2 uzas Newton AI.

source: Skill of computer player 2.
ar: مهارة لاعب الحاسوبي 2.
eo: Kapablo de komputilludanto 2.

source: Pause before each computer move.
ar: توقف مؤقتًا قبل كل حركة للحاسوب.
eo: Paŭzi antaŭ ĉiu movo de komputilo.

source: Pause before each cascade step.
ar: توقف مؤقتًا قبل كل خطوة متتالية.
eo: Paŭzi antaŭ ĉiu kaskada paŝo.

source: Main Toolbar
ar: شريط الأدوات العام
eo: Ĉefa ilobreto

source: KJumpingCube
ar: المكعب القافز ك
eo: Saltkubo

source: Tactical one or two player game
ar: لعبة تكتيكية للاعب واحد أو اثنين
eo: Taktika unu- aŭ du-ludanta ludo

source: (c) 1998-2000, Matthias Kiefer
ar: (ج) 1998-2000، ماتياس كيفر

source: Matthias Kiefer
ar: ماتياس كيفر

source: Benjamin Meyer
ar: بنيامين ماير

source: Various improvements
ar: تحسينات متعددة
eo: Diversaj plibonigoj

source: Ian Wadham
ar: إيان وادهام

source: Upgrade to KDE4 and SVG artwork support.
ar: الترقية إلى دعم العمل الفني كيدي4 وSVG.
eo: Ĝisdatigo al KDE4 kaj SVG-arta subteno.

source: Eugene Trounev
ar: يوجين ترونيف

source: Graphics for KDE 4.0 version.
ar: رسومات لإصدار كيدي 4.0.
eo: Grafikoj por KDE 4.0-versio.

source: Computer Player 1
ar: اللاعب الحاسوبي 1
eo: Komputila Ludanto 1

source: Playing now
ar: يلعب الآن
eo: Ludante nun

source: Style of Play
ar: أسلوب اللعب
eo: Stilo de Ludado

source: Kepler
ar: كيبلر

source: Newton
ar: نيوتن

source: Beginner
ar: مبتدئ
eo: Komencanto

source: Average
ar: معتدل
eo: Averaĝulo

source: Expert
ar: خبير
eo: Spertulo

source: Computer Player 2
ar: اللاعب الحاسوبي 2
eo: Komputila Ludanto 2

source: Pause before each computer move
ar: توقف مؤقتًا قبل كل حركة للحاسوب
eo: Paŭzi antaŭ ĉiu movo de komputilo

source: Board Size
ar: حجم اللوح
eo: Tabula Grandeco

source: Players' Colors
ar: ألوان اللاعبين
eo: Koloroj de ludantoj

source: Player 1:
ar: اللاعب1:
eo: Ludanto 1:

source: Player 2:
ar: اللاعب2:
eo: Ludanto 2:

source: Neutral:
ar: طبيعي:
eo: Neŭtrala:

source: Cascade Move Display
ar: عرض الحركة المتتالية

source: None (no pauses)
ar: لا شيء (دون توقف مؤقت)
eo: Neniu (neniu paŭzoj)

source: Darken and pause
ar: التغميق والتوقف المؤقت
eo: Mallumigi kaj paŭzi

source: Blink rapidly
ar: وميض سريعًا
eo: Palpebrumi rapide

source: Scatter dots
ar: نقاط متناثرة
eo: Disĵeti punktojn

source: Cascade Move Time
ar: وقت التحرك المتتالي
eo: Tempdaŭro de Kaskada Movo

source: Short
ar: قصير
eo: Mallonga

source: Long
ar: طويل
eo: Longa

source: Pause before each cascade step
ar: توقف مؤقتًا قبل كل خطوة متتالية
eo: Paŭzi antaŭ ĉiu kaskada paŝo
